# for i in range(41):
#     print(i)

# # for ი ეს არის ციკლის keyword 
# # i არის საიტერაციო ცვლადი  (იტერაცია ნიშნავს განმეორება)
# # in არის ში ხოლო in range არის დიაპაზონში
# # range(20) ნიშნავს, რომ შეიქმნება მათემატიკური მიმდევრობა რომლის სიგრძეც არის 20
# # range არის მეთოდი რომელსაც არგუმენტად გადაეცა მნიშვნელობა 20
    

# i = 0
# while  i < 41:
#     print(i)
#     i += 1

# # i = 0 ეს არის საიტერაციო ცვლადის დეკლარაცია
# # while(სანამ) ეს არის ციკლის შესაქმნელად საჭირო keyword ი 
# # ციკლი იმუშავებს იქამდე სანამ i ნაკლებია 41
# # თითოეულ დატრიალებაზე დაიპრინტება ჩვენი საიტერაციო ცვლადი i 
#     # რომელიც მნიშვნელობას იზრდის 1 ით
# # i += 1 ეს არის საიტერაციო ცვლადის ინკრემენტაცია (გაზრდა)
# indented - ეს არის ინდენტაცია (TAB გამოყოფა კედლისგან)



# ვთქვათ პაროლი არის 12345 და მომხმარებელმა შეიყვანა 678
guess = int(input("enter your password: "))
password = 12345
while guess != password:
    guess = int(input("enter your password: "))
print("password is correct")